{
  "nav": {
    "home": "Home",
    "about": "About",
    "projects": "Projects",
    "education": "Education",
    "experience": "Experience",
    "hobbies": "Hobbies",
    "contact": "Contact"
  },
  "landing": {
    "welcome": "Welcome to my portfolio",
    "subtitle": "Full Stack Developer & QA Engineer",
    "learnMore": "Learn more"
  },
  "about": {
    "title": "About me",
    "description": "Hi, I'm Aksels. Born in Norway but raised in Latvia. I am a motivated Computer Science student at the University of Latvia and a QA Engineer. My education and work experience have given me a strong foundation in both front-end and back-end technologies. I can both develop interactive and responsive web applications and properly test them, both automated and manually.",
    "skills": "Technical Skills"
  },
  "projects": {
    "title": "Projects",
    "taskManagement": {
      "title": "Task Management System",
      "subtitle": "React + Laravel Full-Stack Application",
      "description": "A modern task management web app featuring user authentication, CRUD operations, and responsive design. Built with React frontend and Laravel API backend. The screenshots showcase the login interface, dashboard with task management, and task creation/editing functionality.",
      "techStack": ["React", "Laravel", "Tailwind CSS", "SQLite", "JWT Authentication"]
    },
    "maphaus": {
      "title": "Maphaus",
      "subtitle": "Car Tuning Website",
      "description": "My favorite project that combines my passion for cars with web development. This car tuning website showcases various tuning modifications that are possible for cars. I Built it using React, TypeScript, CSS.",
      "techStack": ["React", "TypeScript", "CSS", "Car Tuning Content"]
    }
  },
  "education": {
    "title": "Education",
    "current": {
      "degree": "Bachelor's in Computer Science",
      "school": "University of Latvia",
      "date": "2022 - 2026",
      "description": "Studies focused on software development, algorithms, and data structures. The studies have given me skills in web application development and maintenance, as well as a good understanding of the software development process."
    },
    "previous": {
      "degree": "High School Diploma",
      "school": "Rīgas Ziepniekkalna Vidusskola",
      "date": "2010 - 2022",
      "description": ""
    }
  },
  "workExperience": {
    "title": "Experience",
    "current": {
      "title": "Full Stack Developer & QA Engineer",
      "company": "Batsoft",
      "date": "February 2025 - August 2025",
      "description": "Performed manual and automated testing (QA) of websites and mobile applications across various platforms (Android, iOS, Windows), using Postman, TestFlight, Firebase, and Appium (TypeScript) for automated web and mobile app tests. Additionally used HTML, CSS, JavaScript, PHP, WordPress, and Git in daily work on website development and maintenance."
    },
    "previous": {
      "title": "Web Developer Intern",
      "company": "Santa Monica Networks",
      "date": "September 2024 - January 2025",
      "description": "Developed an application using Zabbix API to get the most useful information about complex devices (such as switches). Gained experience with front-end and back-end technologies."
    },
    "internship": {
      "title": "IT Administrator Intern",
      "company": "Skonto Plan",
      "date": "May 2024 - August 2024",
      "description": "Provided technical support and assistance to employees. Helped with system maintenance and troubleshooting. Gained practical experience with various IT systems and tools."
    }
  },
  "hobbies": {
    "title": "Hobbies and Interests",
    "carRepair": {
      "title": "Car Repair and Maintenance",
      "description": "I am passionate about car repair and maintenance. Over time it has become a hobby; I enjoy understanding the mechanics and learning by doing things myself."
    },
    "gym": {
      "title": "Fitness",
      "description": "I regularly run, do strength training and other physical activities."
    },
    "other": {
      "title": "Other Interests",
      "description": "I enjoy exploring new technologies, reading about car innovations, and keeping up with the latest developments in the tech industry. Additionally, I'm learning Norwegian."
    },
    "website": {
      "title": "This Website",
      "description": "This portfolio website was built by me using React.js and styled-components for a modern, responsive design. It includes smooth animations, dark/light mode, and multilingual support (English, Latvian, and Norwegian) using i18next. The site is fully responsive and optimized for all devices, with a focus on performance and user experience."
    }
  },
  "contact": {
    "title": "Contact",
    "subtitle": "Feel free to reach out through these channels",
    "email": {
      "label": "Email",
      "value": "akselssalavs@gmail.com"
    },
    "phone": {
      "label": "Phone",
      "value": "+371 29 363 454"
    },
    "linkedin": {
      "label": "LinkedIn",
      "value": "View my LinkedIn profile"
    }
  },
  "footer": {
    "copyright": "© 2025 Aksels Salavs.",
    "rights": "All rights reserved."
  }
} 